//Тема: Наследование
//Модуль 6
//ДОМАШНЕЕ ЗАДАНИЕ

//Задание 2
//Создать базовый класс «Устройство» и производные классы «Чайник», «Микроволновка», «Автомобиль», «Пароход».
//С помощью конструктора установить имя каждого устройства и его характеристики.
//Реализуйте для каждого из классов методы:
//Sound — издает звук устройства (пишем текстом в консоль);
//Show — отображает название устройства;
//Desc — отображает описание устройства.

namespace hw_04_task2_Devices
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}