//ДОМАШНЕЕ ЗАДАНИЕ

//Тема: Наследование
//Модуль 6

//Задание 3
//Создать базовый класс «Музыкальный инструмент» и производные классы «Скрипка», «Тромбон», «Укулеле», «Виолончель».
//С помощью конструктора установить имя каждого музыкального инструмента и его характеристики.
//Реализуйте для каждого из классов методы:
//Sound — издает звук музыкального инструмента (пишем текстом в консоль);
//Show — отображает название музыкального инструмента;
//Desc — отображает описание музыкального инструмента;
//History — отображает историю создания музыкального инструмента.


namespace hw_04_task3_Instruments
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}